[{
  "_id": {
    "$oid": "61a709f599cbd32738e5e220"
  },
  "currentaffair_id": "4",
  "currentaffair_description": "Kyhytysuka sachicarum is a new marine reptile species discovered by an international team of researchersKyhytysuka sachicarum honours Muisca tribal\nKyhytysuka means “the one that cuts with something sharp”. The word belongs to the indigenous language of central Columbia.\nThe new species has been named Kyhytysuka sachicarum to honour the Muisca culture of central Columbia. The Muisca are also called Chibcha. They were conquered by the Spanish in 1537. They were mainly agrarians. They also extracted salt from the sea.\nFeatures of Kyhytysuka\nIt was a mid – sized ophthalmosaurian. The Ophthalmosaurus belonged to the Jurassic period.\nIt had extremely large sized eyes, dolphin – shaped body.\nThe jaws had many robust teeth.\nIt had several adaptations.\nIt was a macro predatory vertebrate hunter, which means, it hunted larger vertebrates. Vertebrates are organisms with backbone. Organisms without backbone are called invertebrates.\nThe species was mostly found in shallow waters.\nUnique Feature: Teeth\nThe dentary is the longest bone of the species. It measures 720 mm. The dentition is the most unique feature of the species. The teeth are seated in continuous grooves. The teeth are slightly curved posteriorly. Also, an alternating wave – like pattern is observed.",
  "currentaffair_image": "1.jpg",
  "currentaffair_created_at": "12-07-2021",
  "currentaffair_slug": "current_affair_21dec",
  "currentaffair_title": "Kyhytysuka sachicarum: New Marine Reptile Discovered",
  "currentaffair_summary": "found new species."
},{
  "_id": {
    "$oid": "61a7142a99cbd32738e5e223"
  },
  "currentaffair_id": "2",
  "currentaffair_description": "Barbados has become the World’s newest republic, around 400 years after it became a British colony. Highlights Barbados, the Caribbean Island nation, removed Queen Elizabeth II as the head of the state Highlights\nBarbados, the Caribbean Island nation, removed Queen Elizabeth II as the head of the state.\nDame Sandra Prunella Mason, took over as the President of Barbados.\nMason was selected to become the first president of Barbados in October 2021.\nMason was selected as President of Barbados, at a joint meeting of both the Houses of Parliament of Barbados.\nHis name was announced by Speaker of the House of Assembly, Arthur Holder.\nWho is Mason?\nSince 2018, Mason has been the governor-general of the Barbados. Mason completed her judicial education in London, after studying at Queen’s College. She also completed a judicial fellowship in Canada. She started her career as a teacher and worked in banking sector until 1978. She then started working as Magistrate of the Juvenile and Family Court in Barbados. In between 1991 to 1991, she served as Chair & Vice-Chair at UN Committee on Rights of Child. She became the first female who sworn in as Court of Appeal Judge of the Barbados Supreme Court in 2018. In 2014, she became the first Barbadian to be a member of Commonwealth Secretariat Arbitral Tribunal (CSAT). She also became the first female president of the SCAT in 2017.\n\nBackground\nBarbados is said to have been made a ‘slave society’ by the British. It first became an English colony in 1625. In gained its independence in 1966. ",
  "currentaffair_image": "2.jpg",
  "currentaffair_created_at": "Wed Jan 13 2021 ",
  "currentaffair_slug": "current_affair_22dec",
  "currentaffair_title": "Barbados becomes the World’s newest republic",
  "currentaffair_summary": "Barbados become new republic."
},{
  "_id": {
    "$oid": "61a71f6099cbd32738e5e228"
  },
  "currentaffair_id": "3",
  "currentaffair_description": "The Government of India recently formed an Economically Weaker Section (EWS) review panel. The panel will look in to the criteria of 10% reservation for the economically weaker section in government jobs and educational institutions What will the panel do?\nThe panel will review the criteria determining the EWS category.\nIt will examine approaches followed in identifying EWS category.\nIt will analyse and recommend a new criteria to identify the EWS in the country.\nWhy was the panel constituted?\nThe panel was formed following the Supreme Court query to the Government of India. The SC asked “On what rationale, the central government is fixing the quota eligibility at Rs 8 lakh?” For person to be labelled under OBC (Other Backward Caste), his income limit should be less than Rs 8 lakh per annum. This was questioned by the Supreme Court.\n\nHow is the EWS identified currently?\nApart from the above said Rs 8 lakh criteria, the following persons:\n\nOwning five acres of agricultural land\nOwning residential plot of 1,000 square feet\nOwning residential plot of 100 square feet in notified municipalities\nOwning residential plot of 200 square yards in areas other than the notified municipalities\nAre not eligible to get 10% EWS quota.\n\nWhat is the difference between OBC reservation and EWS reservation?\nThe OBC reservation is provided for the non – creamy layer of the Other Backward Classes section. They receive 27% reservation. The EWS reservation is for the “General Class”. They are not covered under OBC, SC or ST.\nIn OBC, the criteria of income of spouse is not included. But in case of EWS, it is included.\nPanel Constituted under Article 15\nArticle 15 (4) says that nothing shall prevent the state from making special provisions for the advancement of the socially and educationally backward classes or scheduled tribes or scheduled caste.",
  "currentaffair_image": "3.jpg",
  "currentaffair_created_at": "Wed Jan 13 2021",
  "currentaffair_slug": "current_affair_23dec",
  "currentaffair_title": "EWS Criteria review panel formed",
  "currentaffair_summary": "Government had formed new EWS pannel."
}]